; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors

(define (domain floor-tile)
(:requirements :typing :action-costs)
(:types robot tile color - object)

(:predicates 	
		(robot-at ?r - robot ?x - tile)
		(up ?x - tile ?y - tile)
		(down ?x - tile ?y - tile)
		(right ?x - tile ?y - tile)
		(left ?x - tile ?y - tile)
		
		(clear ?x - tile)
                (painted ?x - tile ?c - color)
		(robot-has ?r - robot ?c - color)
                (available-color ?c - color)
                (free-color ?r - robot)
)
(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
 ;              (increase (total-cost) 5)
)
) 


(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
;               (increase (total-cost) 2)
)
)


(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
;(increase (total-cost) 2)
)
)


; Robot movements
(:action up 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
  ;             (increase (total-cost) 3)
)
)


(:action down 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
 ;              (increase (total-cost) 1)
)
)

(:action right 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
;	       (increase (total-cost) 1)
)
)

(:action left 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
;               (increase (total-cost) 1)
)
)

)

; problem
(define (problem p01-642)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 tile_0-3 tile_0-4 tile_0-5 
           tile_1-1 tile_1-2 tile_1-3 tile_1-4 tile_1-5 
           tile_2-1 tile_2-2 tile_2-3 tile_2-4 tile_2-5 
           tile_3-1 tile_3-2 tile_3-3 tile_3-4 tile_3-5 
           tile_4-1 tile_4-2 tile_4-3 tile_4-4 tile_4-5 
           tile_5-1 tile_5-2 tile_5-3 tile_5-4 tile_5-5 - tile
           robot1 robot2 - robot
           white black - color
)
(:INIT 
(available-color black) 
(available-color white) 
(clear tile_0-1)
(clear tile_0-2)
(clear tile_0-3)
(clear tile_0-4)
(clear tile_4-1)
(clear tile_4-2)
(clear tile_4-3)
(clear tile_4-4)
(clear tile_5-1)
(clear tile_5-2)
(clear tile_5-3)
(clear tile_5-4)
(clear tile_5-5)
(down tile_0-1 tile_1-1) 
(down tile_0-2 tile_1-2) 
(down tile_0-3 tile_1-3) 
(down tile_0-4 tile_1-4) 
(down tile_0-5 tile_1-5) 
(down tile_1-1 tile_2-1) 
(down tile_1-2 tile_2-2) 
(down tile_1-3 tile_2-3) 
(down tile_1-4 tile_2-4) 
(down tile_1-5 tile_2-5) 
(down tile_2-1 tile_3-1) 
(down tile_2-2 tile_3-2) 
(down tile_2-3 tile_3-3) 
(down tile_2-4 tile_3-4) 
(down tile_2-5 tile_3-5) 
(down tile_3-1 tile_4-1) 
(down tile_3-2 tile_4-2) 
(down tile_3-3 tile_4-3) 
(down tile_3-4 tile_4-4) 
(down tile_3-5 tile_4-5) 
(down tile_4-1 tile_5-1) 
(down tile_4-2 tile_5-2) 
(down tile_4-3 tile_5-3) 
(down tile_4-4 tile_5-4) 
(down tile_4-5 tile_5-5) 
(left tile_0-1 tile_0-2) 
(left tile_0-2 tile_0-3) 
(left tile_0-3 tile_0-4) 
(left tile_0-4 tile_0-5) 
(left tile_1-1 tile_1-2) 
(left tile_1-2 tile_1-3) 
(left tile_1-3 tile_1-4) 
(left tile_1-4 tile_1-5) 
(left tile_2-1 tile_2-2) 
(left tile_2-2 tile_2-3) 
(left tile_2-3 tile_2-4) 
(left tile_2-4 tile_2-5) 
(left tile_3-1 tile_3-2) 
(left tile_3-2 tile_3-3) 
(left tile_3-3 tile_3-4) 
(left tile_3-4 tile_3-5) 
(left tile_4-1 tile_4-2) 
(left tile_4-2 tile_4-3) 
(left tile_4-3 tile_4-4) 
(left tile_4-4 tile_4-5) 
(left tile_5-1 tile_5-2) 
(left tile_5-2 tile_5-3) 
(left tile_5-3 tile_5-4) 
(left tile_5-4 tile_5-5) 
(painted tile_1-1 white)
(painted tile_1-2 black)
(painted tile_1-3 white)
(painted tile_1-4 black)
(painted tile_1-5 white)
(painted tile_2-1 black)
(painted tile_2-2 white)
(painted tile_2-3 black)
(painted tile_2-4 white)
(painted tile_2-5 black)
(painted tile_3-1 white)
(painted tile_3-2 black)
(painted tile_3-3 white)
(painted tile_3-4 black)
(painted tile_3-5 white)
(right tile_0-2 tile_0-1) 
(right tile_0-3 tile_0-2) 
(right tile_0-4 tile_0-3) 
(right tile_0-5 tile_0-4) 
(right tile_1-2 tile_1-1) 
(right tile_1-3 tile_1-2) 
(right tile_1-4 tile_1-3) 
(right tile_1-5 tile_1-4) 
(right tile_2-2 tile_2-1) 
(right tile_2-3 tile_2-2) 
(right tile_2-4 tile_2-3) 
(right tile_2-5 tile_2-4) 
(right tile_3-2 tile_3-1) 
(right tile_3-3 tile_3-2) 
(right tile_3-4 tile_3-3) 
(right tile_3-5 tile_3-4) 
(right tile_4-2 tile_4-1) 
(right tile_4-3 tile_4-2) 
(right tile_4-4 tile_4-3) 
(right tile_4-5 tile_4-4) 
(right tile_5-2 tile_5-1) 
(right tile_5-3 tile_5-2) 
(right tile_5-4 tile_5-3) 
(right tile_5-5 tile_5-4) 
(robot-at robot1 tile_0-5)
(robot-at robot2 tile_4-5)
(robot-has robot1 white)
(robot-has robot2 white)
(up tile_1-1 tile_0-1) 
(up tile_1-2 tile_0-2) 
(up tile_1-3 tile_0-3) 
(up tile_1-4 tile_0-4) 
(up tile_1-5 tile_0-5) 
(up tile_2-1 tile_1-1) 
(up tile_2-2 tile_1-2) 
(up tile_2-3 tile_1-3) 
(up tile_2-4 tile_1-4) 
(up tile_2-5 tile_1-5) 
(up tile_3-1 tile_2-1) 
(up tile_3-2 tile_2-2) 
(up tile_3-3 tile_2-3) 
(up tile_3-4 tile_2-4) 
(up tile_3-5 tile_2-5) 
(up tile_4-1 tile_3-1) 
(up tile_4-2 tile_3-2) 
(up tile_4-3 tile_3-3) 
(up tile_4-4 tile_3-4) 
(up tile_4-5 tile_3-5) 
(up tile_5-1 tile_4-1) 
(up tile_5-2 tile_4-2) 
(up tile_5-3 tile_4-3) 
(up tile_5-4 tile_4-4) 
(up tile_5-5 tile_4-5) 
)
(:goal (and
  (painted tile_4-1 black)
    (painted tile_4-2 white)
    (painted tile_4-3 black)
    (painted tile_4-4 white)
    (painted tile_4-5 black)
))
)

; plan
1. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 0 of 5
2. (up robot2 tile_4-5 tile_5-5)
   deleted: (robot-at robot2 tile_4-5) (clear tile_5-5)
   added: (robot-at robot2 tile_5-5) (clear tile_4-5)
   goals met: 0 of 5
3. (paint-down robot2 tile_4-5 tile_5-5 black)
   deleted: (clear tile_4-5)
   added: (painted tile_4-5 black)
   goals met: 1 of 5
4. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 1 of 5
5. (left robot2 tile_5-5 tile_5-4)
   deleted: (robot-at robot2 tile_5-5) (clear tile_5-4)
   added: (robot-at robot2 tile_5-4) (clear tile_5-5)
   goals met: 1 of 5
6. (paint-down robot2 tile_4-4 tile_5-4 white)
   deleted: (clear tile_4-4)
   added: (painted tile_4-4 white)
   goals met: 2 of 5
7. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 2 of 5
8. (left robot2 tile_5-4 tile_5-3)
   deleted: (robot-at robot2 tile_5-4) (clear tile_5-3)
   added: (robot-at robot2 tile_5-3) (clear tile_5-4)
   goals met: 2 of 5
9. (paint-down robot2 tile_4-3 tile_5-3 black)
   deleted: (clear tile_4-3)
   added: (painted tile_4-3 black)
   goals met: 3 of 5
10. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 3 of 5
11. (left robot2 tile_5-3 tile_5-2)
   deleted: (robot-at robot2 tile_5-3) (clear tile_5-2)
   added: (robot-at robot2 tile_5-2) (clear tile_5-3)
   goals met: 3 of 5
12. (paint-down robot2 tile_4-2 tile_5-2 white)
   deleted: (clear tile_4-2)
   added: (painted tile_4-2 white)
   goals met: 4 of 5
13. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 4 of 5
14. (left robot2 tile_5-2 tile_5-1)
   deleted: (robot-at robot2 tile_5-2) (clear tile_5-1)
   added: (robot-at robot2 tile_5-1) (clear tile_5-2)
   goals met: 4 of 5
15. (paint-down robot2 tile_4-1 tile_5-1 black)
   deleted: (clear tile_4-1)
   added: (painted tile_4-1 black)
   goals met: 5 of 5
